const inventory = [];
let room = "Комната Даши и Маши";

function showInventory() {
    if (inventory.length === 0) {
        alert("Карманы пусты.");
    } else {
        alert("В карманах: " + inventory.join(", "));
    }
}

alert(
    "Миссия Мурзик\n\n" +
    "Накормите тарантула Мурзика и найдите все предметы:\n" +
    "ключ от квартиры, корм для пауков и айрозоль."
);

alert(
    "Звонок от Бабушки...\n" + 
    "- Привет Даша! Я уехала по делам, можешь сходить ко мне в квартиру и покормить Мурзика.\n" +
    "- Конечно бабуль.\n" +
    "- Спасибо! Будь аккуратнее, у него сегодня нет настроения, возьми с собой айрозоль на всякий случай. Еще раз спасибо, Дашуль!\n"
)


while (true) {
    if (room === "Комната Даши и Маши") {
        const choice = prompt(
            "ВЫ В КОМНАТЕ ДАШИ И МАШИ\n" +
            "1 — Комната младших\n" +
            "2 — Коридор\n" +
            "3 — Проверить рюкзак\n" +
            "0 — Завершить игру"
        );

        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "1") {
            room = "Комната младших";
        } else if (choice === "2") {
            room = "Коридор";
        } else if (choice === "3") {
            showInventory();
        } else {
            alert("Такого прохода нет.");
        }
    }
    // Комната младших
    else if (room === "Комната младших") {
        const choice = prompt(
            "КОМНАТА МЛАДШИХ\n" +
            "1 — Подойти к кровати Пуговки\n" +
            "2 — Вернуться в свою комнату\n" +
            "0 — Завершить игру"
        );

        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "1") {
            room = "Кровать пуговки";
        } else if (choice === "2") {
            room = "Комната Даши и Маши";
        } else {
            alert("Такого прохода нет.");
        }
    }
    // кровать пуговки
    else if (room === "Кровать пуговки") {
        const choice = prompt(
            "КРОВАТЬ ПУГОВКИ\n" +
            "Под одеялом что то лежит. \n" +
            "1 — Поднять одеяло\n" +
            "2 — Вернуться ко входу в комнату младших\n" +
            "0 — Завершить игру"
        )
        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "1") {
            if (inventory.includes("Игрушечный паук")) {
                alert("Под одеялом пусто. Игрушка уже у вас.");
            } else {
                const takeKey = confirm("под одеялом лежит игрушечный паук. Взять его?");

                if (takeKey === true) {
                    inventory.push("Игрушечный паук");
                    alert("Игрушка взята!");
                } else {
                    alert("Вы оставили игрушку на кровати.");
                }
            }
        } else if (choice === "2") {
            room = "Комната младших";
        } else {
            alert("Такого действия нет.");
        }
    }
    // коридор
    else if (room === "Коридор") {
        const choice = prompt(
            "ВЫ В КОРИДОРЕ\n" +
            "1 — Комната Даши и Маши\n" +
            "2 — Комната младших\n" +
            "3 — Зал\n" +
            "4 — Туалет\n" +
            "5 — Подъезд\n" +
            "6 — Проверить рюкзак\n" +
            "0 — Завершить игру"
        );
        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "1") {
            room = "Комната Даши и Маши";
        } else if (choice === "2") {
            room = "Комната младших";
        } else if (choice === "3") {
            room = "Зал";
        } else if (choice === "4") {
            room = "Туалет";
        } else if (choice === "5") {
            room = "Подъезд";
        } else if (choice === "6") {
            showInventory();
        } else {
            alert("Такого прохода нет.");
        }
    }
    else if(room === "Зал"){
        const choice = prompt(
            "ВЫ В ЗАЛЕ\n"

        )
    }
}